/*
ДОМАШНЕЕ ЗАДАНИЕ (9 СМЕИНАР)

Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

/*
void ShowNums(int N)
{
    if (N > 0)
    {
        System.Console.Write(N + " ");
        ShowNums(N - 1);
    }
}

System.Console.Write("Введите любое число: ");
int userNumber = Convert.ToInt32(Console.ReadLine());
ShowNums(userNumber);
*/

